Revit 2024 API
UpdaterId Members
The UpdaterId type exposes the following members.
Constructors
Name | Description
UpdaterId
 creates an instance of UpdaterId for given AddInId and a given GUID value
Methods
Name | Description
Dispose
Releases all resources used by the UpdaterId
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetAddInId
 AddInId of the UpdaterId
GetGUID
 GUID value of the UpdaterId
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
UpdaterId Class
Autodesk.Revit.DB Namespace